load_testing/output/observations_n500c30.txt
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.72.170.113 (be patient)


Server Software:        Apache-Coyote/1.1
Server Hostname:        54.72.170.113
Server Port:            8080

Document Path:          /webapp/sos/rest/observations
Document Length:        1000 bytes

Concurrency Level:      30
Time taken for tests:   63.616 seconds
Complete requests:      500
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Non-2xx responses:      498
Total transferred:      588636 bytes
Total body sent:        1102000
HTML transferred:       498000 bytes
Requests per second:    7.86 [#/sec] (mean)
Time per request:       3816.968 [ms] (mean)
Time per request:       127.232 [ms] (mean, across all concurrent requests)
Transfer rate:          9.04 [Kbytes/sec] received
                        16.92 kb/s sent
                        25.95 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       53 1076 915.3    551    4895
Processing:   170 2477 2986.4   1296   21714
Waiting:        0 2391 2732.4   1205   19575
Total:        242 3554 3152.2   2658   22155

Percentage of the requests served within a certain time (ms)
  50%   2658
  66%   3798
  75%   4813
  80%   5339
  90%   6987
  95%   9103
  98%  13701
  99%  16421
 100%  22155 (longest request)