load_testing/output/observations_n60c10.txt
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.72.170.113 (be patient).....done


Server Software:        Apache-Coyote/1.1
Server Hostname:        54.72.170.113
Server Port:            8080

Document Path:          /webapp/sos/rest/observations
Document Length:        1000 bytes

Concurrency Level:      10
Time taken for tests:   6.621 seconds
Complete requests:      60
Failed requests:        0
Non-2xx responses:      60
Total transferred:      70920 bytes
Total body sent:        132240
HTML transferred:       60000 bytes
Requests per second:    9.06 [#/sec] (mean)
Time per request:       1103.555 [ms] (mean)
Time per request:       110.355 [ms] (mean, across all concurrent requests)
Transfer rate:          10.46 [Kbytes/sec] received
                        19.50 kb/s sent
                        29.96 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       84  405 532.5    144    2382
Processing:   214  595 514.2    365    1916
Waiting:      213  595 514.2    365    1916
Total:        316 1000 672.8    611    2808

Percentage of the requests served within a certain time (ms)
  50%    611
  66%   1420
  75%   1618
  80%   1635
  90%   1968
  95%   2129
  98%   2411
  99%   2808
 100%   2808 (longest request)